openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
#if (USE_CAN_STATISTICS == STD_ON)
    if (canHw->ESR.B.TWRNINT) {
        err.B.TXWRN = canHw->ESR.B.TXWRN;
        canUnit->stats.txErrorCnt++;
        canHw->ESR.B.TWRNINT = 1;
    }

    if (canHw->ESR.B.RWRNINT) {
        err.B.RXWRN = canHw->ESR.B.RXWRN;
        canUnit->stats.rxErrorCnt++;
        canHw->ESR.B.RWRNINT = 1;
    }
#endif

    if (err.R != 0) {
        if (GET_CALLBACKS()->Arc_Error != NULL) {
            GET_CALLBACKS()->Arc_Error(unit, err);
        }
    }

    if (canHw->ESR.B.BOFFINT) {
#if (USE_CAN_STATISTICS == STD_ON)
        canUnit->stats.boffCnt++;
#endif
        if (GET_CALLBACKS()->ControllerBusOff != NULL) {
            GET_CALLBACKS()->ControllerBusOff(unit);
        }
        Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272

        canHw->ESR.B.BOFFINT = 1;

        Can_AbortTx(canHw, canUnit); // CANIF273
    }
}

/**
 *
 * @param uPtr
 */
static void Can_Isr_Tx(Can_UnitType *uPtr)
{
    uint8 mbNr;
    flexcan_t *canHw;

    canHw = uPtr->hwPtr;

    uint64_t mbMask = ((uint64_t) (canHw->IFRH.R)<< 32) + canHw->IFRL.R;
    mbMask &= uPtr->Can_Arc_TxMbMask;

    /*
     * Tx
     */
    for (; mbMask; mbMask &= ~(1 << mbNr)) {
        mbNr = ilog2(mbMask);

        if (GET_CALLBACKS()->TxConfirmation != NULL) {
            GET_CALLBACKS()->TxConfirmation(uPtr->swPduHandles[mbNr]);
        }
        uPtr->swPduHandles[mbNr] = 0; // Is this really necessary ??

        // Clear interrupt
        clearMbFlag(canHw,mbNr);
        uPtr->mbTxFree |= (1 << mbNr);
    }
}

static void Can_Isr_Rx(Can_UnitType *uPtr)
{
    uint8 mbNr;
    uint32 id;
    uint32 mask;

    flexcan_t *canHw;
    const Can_HardwareObjectType *hohPtr;

    canHw = uPtr->hwPtr;

    uint32 iFlagLow = (canHw->IFRL.R & canHw->IMRL.R);
    uint64_t iFlag = ((uint64_t) (canHw->IFRH.R & canHw->IMRH.R) << 32)
            + iFlagLow;

    while (iFlag & uPtr->Can_Arc_RxMbMask) {

        /* Find mailbox */
        mbNr = ilog2_64(iFlag);
        iFlag ^= 1 << mbNr;

        /* Check for FIFO interrupt */
        if (canHw->MCR.B.FEN && (iFlagLow & (1 << 5))) {

#if (USE_CAN_STATISTICS == STD_ON)
            /* Check overflow */
            if (iFlagLow & (1 << 7)) {
                uPtr->stats.fifoOverflow++;
                canHw->IFRL.B.BUF07I = 1;
            }

            /* Check warning */
            if (iFlagLow & (1 << 6)) {
                uPtr->stats.fifoWarning++;
                canHw->IFRL.B.BUF06I = 1;
            }
#endif

            /* The manual is "fuzzy" here, read control and status */
            (void) canHw->BUF[0].CS.R;

            if (canHw->BUF[0].CS.B.IDE) {
                id = canHw->BUF[0].ID.R;
                id |= 0x80000000;
            } else {
                id = canHw->BUF[0].ID.B.STD_ID;
            }

            /* Must now do a manual match to find the right CanHardwareObject
             * to pass to CanIf. We know that the FIFO objects are sorted first.
             */
            hohPtr = uPtr->cfgCtrlPtr->Can_Arc_Hoh;

            /* Match in order */
            vuint32_t *fifoIdPtr = (vuint32_t *) &canHw->BUF[6];

            for (mbNr = 0; mbNr < uPtr->cfgCtrlPtr->Can_Arc_HohFifoCnt; mbNr++) {
                mask = canHw->RXIMR[mbNr].R;

                if ((id & mask) != (fifoIdPtr[mbNr] & mask)) {
                    continue;
                }

                if (GET_CALLBACKS()->RxIndication != NULL) {
                    GET_CALLBACKS()->RxIndication(uPtr->mbToHrh[mbNr],
                            canHw->BUF[0].ID.B.EXT_ID,
                            canHw->BUF[0].CS.B.LENGTH,
                            (uint8 *) &canHw->BUF[0].DATA.W[0]);
                }
                break;
            }

            // Clear the interrupt
            canHw->IFRL.B.BUF05I = 1;
        } else {
            /* Not FIFO */

            /* activate the internal lock with a read*/
            (void) canHw->BUF[mbNr].CS.R;

            if (canHw->BUF[mbNr].CS.B.IDE) {
                id = canHw->BUF[mbNr].ID.R;
                id |= 0x80000000;
            } else {
                id = canHw->BUF[mbNr].ID.B.STD_ID;
            }

            if (GET_CALLBACKS()->RxIndication != NULL) {
                GET_CALLBACKS()->RxIndication(uPtr->mbToHrh[mbNr], id,
                        canHw->BUF[mbNr].CS.B.LENGTH,
                        (uint8 *) &canHw->BUF[mbNr].DATA.W[0]);
            }
#if (USE_CAN_STATISTICS == STD_ON)
            uPtr->stats.rxSuccessCnt++;
#endif
            /* unlock MB (dummy read timer) */
            (void) canHw->TIMER.R;

            // Clear interrupt
            clearMbFlag(canHw, mbNr);
        }
    }
}


static void Can_Isr(int controller )
{
    Can_UnitType *uPtr = &CanUnit[controller];

    if(uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_TX_PROCESSING_INTERRUPT ){
        Can_Isr_Tx(uPtr);
    }

    if(uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT ){
        Can_Isr_Rx(uPtr);
    }
}


//-------------------------------------------------------------------

static void Can_BuildMaps(Can_UnitType *uPtr)
{
    uint8_t mbNr = 8;
    uint8_t fifoNr = 0;

    const Can_HardwareObjectType *hohPtr = uPtr->cfgCtrlPtr->Can_Arc_Hoh;

    printf("Found %d HOHs\n", uPtr->cfgCtrlPtr->Can_Arc_HohCnt);

    for (int i = 0; i < uPtr->cfgCtrlPtr->Can_Arc_HohCnt; i++, hohPtr++) {
        if (hohPtr->CanObjectType == CAN_OBJECT_TYPE_RECEIVE) {
            /* First 8 boxes are FIFO */
            if (hohPtr->Can_Arc_Flags & CAN_HOH_FIFO_MASK) {
                uPtr->mbToHrh[fifoNr++] = hohPtr->CanObjectId;
                uPtr->Can_Arc_RxMbMask |= (1<<0);
            } else {
                uint64_t mask = (-1ULL);
                uPtr->mbToHrh[mbNr] = hohPtr->CanObjectId;

                mask >>= (mbNr);
                mask <<= (mbNr);
                mask <<= 64 - (mbNr + hohPtr->Can_Arc_MbCount);
                mask >>= 64 - (mbNr + hohPtr->Can_Arc_MbCount);
                uPtr->Can_Arc_RxMbMask |= mask;

                mbNr += hohPtr->Can_Arc_MbCount;
            }
            printf("mbNr=%d fifoNr=%d\n", mbNr, fifoNr);

        } else {
            uint64_t mask = (-1ULL);

            /* Hth to HOH
             * i = index into the HOH list for this controller */
            Can_HthToHohMap[ hohPtr->CanObjectId ] = i;
            Can_HthToUnitIdMap[ hohPtr->CanObjectId ] = uPtr->controllerId;
            /* HOH to Mailbox */
            uPtr->mbToHrh[mbNr] = hohPtr->CanObjectId;

