openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
            mask >>= (mbNr);
            mask <<= (mbNr);
            mask <<= 64 - (mbNr + hohPtr->Can_Arc_MbCount);
            mask >>= 64 - (mbNr + hohPtr->Can_Arc_MbCount);
            uPtr->Can_Arc_TxMbMask |= mask;
            mbNr += hohPtr->Can_Arc_MbCount;
        }
    }
    uPtr->mbMax = mbNr;
}



// This initiates ALL can controllers
void Can_Init(const Can_ConfigType *config)
{
    /** @req 3.1.5/CAN223 */
    /** !req 3.1.5/CAN176 */

    Can_UnitType *unitPtr;

    /** @req 3.1.5/CAN174 */
    VALIDATE_NO_RV( (Can_Global.initRun == CAN_UNINIT), 0x0, CAN_E_TRANSITION );
    /** @req 3.1.5/CAN175 */
    VALIDATE_NO_RV( (config != NULL ), 0x0, CAN_E_PARAM_POINTER );

    // Save config
    Can_Global.config = config;
    Can_Global.initRun = CAN_READY;

    for (int configId = 0; configId < CAN_ARC_CTRL_CONFIG_CNT; configId++) {
        const Can_ControllerConfigType *cfgCtrlPtr  = &Can_Global.config->CanConfigSet->CanController[configId];

        Can_Global.configured |= (1 << cfgCtrlPtr->CanControllerId);

        unitPtr = &CanUnit[configId];

        memset(unitPtr, 0, sizeof(Can_UnitType));

        unitPtr->controllerId = cfgCtrlPtr->CanControllerId;
        unitPtr->hwPtr = GET_CONTROLLER(cfgCtrlPtr->CanControllerId);
        unitPtr->cfgCtrlPtr = cfgCtrlPtr;
        unitPtr->state = CANIF_CS_STOPPED;
        unitPtr->cfgHohPtr = cfgCtrlPtr->Can_Arc_Hoh;

        Can_BuildMaps(unitPtr);

        Can_InitController(cfgCtrlPtr->CanControllerId,unitPtr->cfgCtrlPtr);

        switch (cfgCtrlPtr->CanControllerId) {
#if defined(CFG_MPC5606S)
        case CAN_CTRL_A:
        ISR_INSTALL_ISR2( "Can", Can_A_BusOff, FLEXCAN_0_ESR_BOFF_INT, 2, 0);
        ISR_INSTALL_ISR2( "Can", Can_A_Err, FLEXCAN_0_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER4( "Can", Can_A_Isr, FLEXCAN_0_BUF_00_03, 2, 0 ); /* 0-3, 4-7, 8-11, 12-15 */
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_0_BUF_16_31, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_0_BUF_32_63, 2, 0 );
        break;
        case CAN_CTRL_B:
        ISR_INSTALL_ISR2( "Can", Can_B_BusOff, FLEXCAN_1_ESR_BOFF_INT, 2, 0);
        ISR_INSTALL_ISR2( "Can", Can_B_Err, FLEXCAN_1_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER4( "Can", Can_B_Isr, FLEXCAN_1_BUF_00_03, 2, 0 ); /* 0-3, 4-7, 8-11, 12-15 */
        ISR_INSTALL_ISR2( "Can", Can_B_Isr, FLEXCAN_1_BUF_16_31, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_B_Isr, FLEXCAN_1_BUF_32_63, 2, 0 );
        break;
#elif defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567)
        case CAN_CTRL_A:
        ISR_INSTALL_ISR2( "Can", Can_A_BusOff, FLEXCAN_A_ESR_BOFF_INT, 2, 0);
        ISR_INSTALL_ISR2( "Can", Can_A_Err, FLEXCAN_A_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_A_Isr, FLEXCAN_A_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_A_IFLAG1_BUF31_16I, 2, 0 );
        break;
        case CAN_CTRL_B:
        ISR_INSTALL_ISR2( "Can", Can_B_BusOff, FLEXCAN_B_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_B_Err, FLEXCAN_B_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_B_Isr, FLEXCAN_B_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_B_Isr, FLEXCAN_B_IFLAG1_BUF31_16I, 2, 0 );
        break;
        case CAN_CTRL_C:
        ISR_INSTALL_ISR2( "Can", Can_C_BusOff, FLEXCAN_C_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_C_Err, FLEXCAN_C_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_C_Isr, FLEXCAN_C_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_C_Isr, FLEXCAN_C_IFLAG1_BUF31_16I, 2, 0 );
        break;
        case CAN_CTRL_D:
        ISR_INSTALL_ISR2( "Can", Can_D_BusOff, FLEXCAN_D_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_D_Err, FLEXCAN_D_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_D_Isr, FLEXCAN_D_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_D_Isr, FLEXCAN_D_IFLAG1_BUF31_16I, 2, 0 );
        break;
        case CAN_CTRL_E:
        ISR_INSTALL_ISR2( "Can", Can_E_BusOff, FLEXCAN_E_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_E_Err, FLEXCAN_E_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_E_Isr, FLEXCAN_E_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_E_Isr, FLEXCAN_E_IFLAG1_BUF31_16I, 2, 0 );
        break;
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
        case CAN_CTRL_F:
        ISR_INSTALL_ISR2( "Can", Can_F_BusOff, FLEXCAN_F_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_F_Err, FLEXCAN_F_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_F_Isr, FLEXCAN_F_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_F_Isr, FLEXCAN_F_IFLAG1_BUF31_16I, 2, 0 );
        break;
#endif
        default:
            assert(0);
        }
    }
    return;
}

// Unitialize the module
void Can_DeInit()
{
    Can_UnitType *canUnit;
    const Can_ControllerConfigType *cfgCtrlPtr;
    uint32 ctlrId;

    for (int configId = 0; configId < CAN_ARC_CTRL_CONFIG_CNT; configId++) {
        cfgCtrlPtr = &Can_Global.config->CanConfigSet->CanController[(configId)];
        ctlrId = cfgCtrlPtr->CanControllerId;

        canUnit = CTRL_TO_UNIT_PTR(ctlrId);
        canUnit->state = CANIF_CS_UNINIT;

        Can_DisableControllerInterrupts(ctlrId);

        canUnit->lock_cnt = 0;

#if (USE_CAN_STATISTICS == STD_ON)
        // Clear stats
        memset(&canUnit->stats, 0, sizeof(Can_Arc_StatisticsType));
#endif
    }

    Can_Global.config = NULL;
    Can_Global.initRun = CAN_UNINIT;

    return;
}

void Can_InitController(uint8 controller,
        const Can_ControllerConfigType *config)
{
    /** @req 3.1.5/CAN229 */
    /** !req 3.1.5/CAN192 */

    flexcan_t *canHw;
    uint8_t tq;
    uint8_t tq1;
    uint8_t tq2;
    uint32_t clock;
    Can_UnitType *canUnit;
    uint8 cId = controller;
    const Can_ControllerConfigType *cfgCtrlPtr;
    const Can_HardwareObjectType *hohPtr;
    uint8_t fifoNr;

