openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    return rv;
}

void Can_DisableControllerInterrupts(uint8 controller)
{
    /** @req 3.1.5/CAN231 */
    /** @req 3.1.5/CAN202 */
    /** !req 3.1.5/CAN204 */
    /** !req 3.1.5/CAN292 */

    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(controller);
    flexcan_t *canHw;
    imask_t state;

    /** @req 3.1.5/CAN205 */
    VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x4, CAN_E_UNINIT );

    /** @req 3.1.5/CAN206 */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller) , 0x4, CAN_E_PARAM_CONTROLLER );


    Irq_Save(state);
    /** @req 3.1.5/CAN049 */
    if (canUnit->lock_cnt > 0) {
        // Interrupts already disabled
        canUnit->lock_cnt++;
        Irq_Restore(state);
        return;
    }
    canUnit->lock_cnt++;
    Irq_Restore(state);

    /* Don't try to be intelligent, turn everything off */
    canHw = GET_CONTROLLER(controller);

    /* Turn off the interrupt mailboxes */
    canHw->IMRH.R = 0;
    canHw->IMRL.R = 0;

    /* Turn off the bus off/tx warning/rx warning and error */
    canHw->MCR.B.WRNEN = 0; /* Disable warning int */
    canHw->CR.B.ERRMSK = 0; /* Disable error interrupt */
    canHw->CR.B.BOFFMSK = 0; /* Disable bus-off interrupt */
    canHw->CR.B.TWRNMSK = 0; /* Disable Tx warning */
    canHw->CR.B.RWRNMSK = 0; /* Disable Rx warning */
}

void Can_EnableControllerInterrupts(uint8 controller)
{
    /** @req 3.1.5/CAN232 */
    /** @req 3.1.5/CAN050 */
    /** !req 3.1.5/CAN293 Not applicable */

    Can_UnitType *canUnit;
    flexcan_t *canHw;
    imask_t state;

    canUnit = CTRL_TO_UNIT_PTR(controller);
    /** @req 3.1.5/CAN209 */
    VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x5, CAN_E_UNINIT );

    /** @req 3.1.5/CAN210 */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller), 0x5, CAN_E_PARAM_CONTROLLER );

    Irq_Save(state);
    if (canUnit->lock_cnt > 1) {
        /** @req 3.1.5/CAN208 */
        // IRQ should still be disabled so just decrement counter
        canUnit->lock_cnt--;
        Irq_Restore(state);
        return;
    } else if (canUnit->lock_cnt == 1) {
        canUnit->lock_cnt = 0;
    }
    Irq_Restore(state);

    canHw = canUnit->hwPtr;

    canHw->IMRH.R = 0;
    canHw->IMRL.R = 0;

    if (canUnit->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT ) {
        /* Turn on the interrupt mailboxes */
        canHw->IMRL.R = canUnit->Can_Arc_RxMbMask;
    }

    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_TX_PROCESSING_INTERRUPT) {
        /* Turn on the interrupt mailboxes */
        canHw->IMRL.R |= canUnit->Can_Arc_TxMbMask;
    }

    // BusOff here represents all errors and warnings
    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_BUSOFF_PROCESSING_INTERRUPT) {
        canHw->MCR.B.WRNEN = 1; /* Turn On warning int */

        canHw->CR.B.ERRMSK = 1; /* Enable error interrupt */
        canHw->CR.B.BOFFMSK = 1; /* Enable bus-off interrupt */
        canHw->CR.B.TWRNMSK = 1; /* Enable Tx warning */
        canHw->CR.B.RWRNMSK = 1; /* Enable Rx warning */
    }

    return;
}

Can_ReturnType Can_Write(Can_Arc_HTHType hth, Can_PduType *pduInfo)
{
    /** @req 3.1.5/CAN223 */
    /** !req 3.1.5/CAN213 Priorities not supported */
    /** !req 3.1.5/CAN215 Priorities not supported */
    /** @req 3.1.5/CAN214 */
    /** @req 3.1.5/CAN272 */

    uint16_t timer;
    uint64_t iflag;
    Can_ReturnType rv = CAN_OK;
    uint32_t mbNr;
    flexcan_t *canHw;
    const Can_HardwareObjectType *hohObj;
    Can_UnitType *canUnit;
    imask_t state;

    /** @req 3.1.5/CAN216 */
    VALIDATE( (Can_Global.initRun == CAN_READY), 0x6, CAN_E_UNINIT );
    /** @req 3.1.5/CAN219 */
    VALIDATE( (pduInfo != NULL), 0x6, CAN_E_PARAM_POINTER );
    /** @req 3.1.5/CAN218 */
    VALIDATE( (pduInfo->length <= 8), 0x6, CAN_E_PARAM_DLC );
    /** @req 3.1.5/CAN217 */
    VALIDATE( (hth < NUM_OF_HTHS ), 0x6, CAN_E_PARAM_HANDLE );

    canUnit = &CanUnit[Can_HthToUnitIdMap[hth]];
    hohObj = &canUnit->cfgHohPtr[Can_HthToHohMap[hth]];
    canHw = canUnit->hwPtr;

    /* We have the hohObj, we need to know what box we can send on */

    Irq_Save(state);
    uint64_t iHwFlag = (  (uint64_t)(canHw->IFRH.R & canHw->IMRH.R)<<32) +
                        (canHw->IFRL.R & canHw->IMRL.R);

    iflag = (iHwFlag & (canUnit->Can_Arc_TxMbMask)) |  canUnit->mbTxFree;

    /** @req 3.1.5/CAN212 */
    if (iflag ) {
        mbNr = ilog2_64(iflag ); // find mb number

        /* Indicate that we are sending this MB */
        canUnit->mbTxFree &= ~(1<<mbNr);

        // Setup message box type
        if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
            canHw->BUF[mbNr].CS.B.IDE = 1;
        } else if (hohObj->CanIdType == CAN_ID_TYPE_STANDARD) {
            canHw->BUF[mbNr].CS.B.IDE = 0;
        } else {
            // No support for mixed in this processor
            assert(0);
        }

        // Send on buf
        canHw->BUF[mbNr].CS.B.CODE = MB_INACTIVE; // Hold the transmit buffer inactive
        if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
            canHw->BUF[mbNr].ID.R = pduInfo->id; // Write 29-bit MB IDs
        } else {
            assert( !(pduInfo->id & 0xfffff800) );
            canHw->BUF[mbNr].ID.B.STD_ID = pduInfo->id;
        }

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S)
        canHw->BUF[mbNr].ID.B.PRIO = 1; // Set Local Priority
#endif

        memset(&canHw->BUF[mbNr].DATA, 0, 8);
        memcpy(&canHw->BUF[mbNr].DATA, pduInfo->sdu, pduInfo->length);

        canHw->BUF[mbNr].CS.B.SRR = 1;
        canHw->BUF[mbNr].CS.B.RTR = 0;

        canHw->BUF[mbNr].CS.B.LENGTH = pduInfo->length;
        canHw->BUF[mbNr].CS.B.CODE = MB_TX_ONCE; // Write tx once code
        timer = canHw->TIMER.R; // Unlock Message buffers

#if (USE_CAN_STATISTICS == STD_ON)
        canUnit->stats.txSuccessCnt++;
#endif

        // Store pdu handle in unit to be used by TxConfirmation
        canUnit->swPduHandles[mbNr] = pduInfo->swPduHandle;

    } else {
        rv = CAN_BUSY;
    }
    Irq_Restore(state);

