openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    return rv;
}

void Can_Cbk_CheckWakeup( uint8 controller ) {
    /** !req 3.1.5/CAN360 */
    /** !req 3.1.5/CAN361 */
    /** !req 3.1.5/CAN362 */
    /** !req 3.1.5/CAN363 */

    /* NOT SUPPORTED */
}


void Can_MainFunction_Write( void ) {
    /** !req 3.1.5/CAN225 */
    /** !req 3.1.5/CAN031 */
    /** !req 3.1.5/CAN178 */
    /** !req 3.1.5/CAN179 */
    Can_UnitType *uPtr;

    for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
        uPtr = &CanUnit[i];
        if( (uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_TX_PROCESSING_INTERRUPT) == 0 ) {
            Can_Isr_Tx(uPtr);
        }
    }
}

void Can_MainFunction_Read(void)
{
    /** !req 3.1.5/CAN226 */
    /** !req 3.1.5/CAN108 */
    /** !req 3.1.5/CAN180 */
    /** !req 3.1.5/CAN181 */
    Can_UnitType *uPtr;

    for(int i=0;i<CAN_ARC_CTRL_CONFIG_CNT; i++ ) {
        uPtr = &CanUnit[i];
        if( (uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT) == 0 ) {
            Can_Isr_Rx(uPtr);
        }
    }
}

void Can_MainFunction_BusOff(void)
{
    /** !req 3.1.5/CAN227 */
    /** !req 3.1.5/CAN109 */
    /** !req 3.1.5/CAN183 */
    /** !req 3.1.5/CAN184 */
    /* Bus-off polling events */

}

void Can_MainFunction_Wakeup(void)
{
    /** !req 3.1.5/CAN228 */
    /** !req 3.1.5/CAN112 */
    /** !req 3.1.5/CAN185 */
    /** !req 3.1.5/CAN186 */
    /* Wakeup polling events */

    /* NOT SUPPORTED */
}

#if (USE_CAN_STATISTICS == STD_ON)
/**
 * Get send/receive/error statistics for a controller
 *
 * @param controller The controller
 * @param stats Pointer to data to copy statistics to
 */


void Can_Arc_GetStatistics(uint8 controller, Can_Arc_StatisticsType *stats)
{
    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(controller);
    *stats = canUnit->stats;
}
#endif

